const trains = [{
    title: 'Трамвай №1',
    body: 'Залізничний вокзал – Приміський вокзал – пл. Кропивницького – вул. Русових – Львівська політехніка – Головна Пошта – вул. Дорошенка – пл. Ринок – вул. Руська – пл. Митна – Війсковий госпіталь – вул. Кармалюка – вул. Мечникова – вул. Богдана Котика – вул. Пасічна – вул. Богдана Котика – вул. Мечникова – Медичний університет – Війсковий госпіталь – пл. Митна – вул. Руська – вул. Дорошенка – Головна Пошта – Львівська політехніка – вул. Карпінського – пл. Кропивницького – Приміський вокзал – Залізничний вокзал'
},{
    title: 'Трамвай №2',
    body: 'вул. Коновальця (Музей Труша) – вул. Гординських – вул. Залізняка – вул. Мельника – Фабрика Левинського – вул. Київська – Львівська політехніка – Головна Пошта – вул. Петра Дорошенка – пл. Ринок – вул. Руська – пл. Митна – Війсковий госпіталь – вул. Кармалюка – вул. Мечникова – вул. Богдана Котика – вул. Пасічна – вул. Богдана Котика – вул. Мечникова – Медичний університет – Війсковий госпіталь – пл. Митна – вул. Руська – вул. Дорошенка – Головна Пошта – Львівська політехніка – вул. Київська – Фабрика Левинського – вул. Мельника – вул. Максима Залізняка – вул. Гординських – вул. Коновальця (Музей Труша)'
},{
    title: 'Трамвай №3',
    body: 'пл. Соборна – вул. Шухевича – вул. Саксаганського – пл. Франка – Парк культури – вул. Сахарова – вул. Горбачевського – вул. Шумського – вул. Аркаса – вул. Бойчука (Кіноцентр) – Аквапарк – вул. Бойчука (Кіноцентр) – вул. Аркаса – вул. Шумського – вул. Горбачевського – вул. Сахарова – Парк культури – пл. Франка – вул. Саксаганського – пл. Соборна'
},{
    title: 'Трамвай №4',
    body: 'Залізничний вокзал – Приміський вокзал – пл. Кропивницького – вул. Русових – вул. Київська – вул. Сахарова – Парк культури – пл. Франка – Стрийський парк – Академія Мистецтв – стадіон «Україна» – вул. Угорська – ТРЦ «Шувар» – Дитяча поліклініка – Центр Довженка – Поліклініка №4 – вул. Коломийська – вул. Драгана – вул. Вернадського – вул. Драгана – вул. Коломийська – Поліклініка №4 – Центр Довженка – Дитяча поліклініка – ТРЦ «Шувар» – вул. Угорська – стадіон «Україна» – Академія Мистецтв – Стрийський парк – Стрийський ринок – Парк культури – вул. Академіка Сахарова – вул. Київська – вул. Русових – пл. Кропивницького – Приміський вокзал – Залізничний вокзал'
},{
    title: 'Трамвай №6',
    body: 'ТРЦ «Скриня» – Привокзальний ринок – пл. Кропивницького – Церква святої Анни – вул. Наливайка – пл. Старий Ринок – вул. Під Дубом – Палац культури ім. Гната Хоткевича – станція Підзамче – вул. Якова Остряниці – вул. Промислова – Трамвайне депо №2 – Фабрика «Світанок» – вул. Липинського – вул. Миколайчука – Фабрика «Світанок» – Трамвайне депо №2 – вул. Промислова – вул. Якова Остряниці – станція Підзамче – вул. Гайдамацька – Палац культури ім. Гната Хоткевича – пл. Старий Ринок – вул. Театральна – ТЦ «Магнус» – Церква святої Анни – Театр ім. Лесі Українки – пл. Кропивницького – Привокзальний ринок – вул. Кульпарківська'
}]

function selectPage(ID) {
    leftCurrentPage();
    changeTitle(trains[ID-1].title);
    changeText(trains[ID-1].body);
    document.getElementsByClassName('buttonTrain')[ID-1].classList.add('active');
}

function leftCurrentPage() {
    document.getElementsByClassName('active')[0].classList.remove('active');
}

function changeTitle(title) {
    document.getElementById('titleTable').innerText = title;
}

function changeText(text) {
    document.getElementById('textTable').innerText = text;
}
